<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"0e76572b06ff907f23ab74b3d8b833d57ad694ff8c14c9df1e34f114fc4618f5","plan_job_ref":"Job PR on main #21 at https://github.com/softkitit/softkit-nestjs-boilerplate/actions/runs/8892830447","plan_out_hash":"7ef9d878ce7be64a1a7a19ff488bc88079fad538188b07c816d1c7d0ddeee761","plan_hash":"94ee3103497b530eeaa44a91a571f2d376ad69c9d61d011a9f6c43f8fa272e46","plan_text_format":"diff","version":"1.42.0"} -->
Terraform plan in __apps/platform/terraform-ci/__
With backend config files: `apps/platform/terraform-ci/backends/deployment.s3.tfbackend`
With var files: `apps/platform/terraform-ci/vars/deployment.tfvars`
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.ecr.aws_ecr_lifecycle_policy.name["softkit-nestjs-boilerplate-platform"] will be created
+   resource "aws_ecr_lifecycle_policy" "name" {
+       id          = (known after apply)
+       policy      = jsonencode(
            {
+               rules = [
+                   {
+                       action       = {
+                           type = "expire"
                        }
+                       description  = "Protects images tagged with release"
+                       rulePriority = 1
+                       selection    = {
+                           countNumber   = 999999
+                           countType     = "imageCountMoreThan"
+                           tagPrefixList = [
+                               "release",
                            ]
+                           tagStatus     = "tagged"
                        }
                    },
+                   {
+                       action       = {
+                           type = "expire"
                        }
+                       description  = "Remove untagged images"
+                       rulePriority = 2
+                       selection    = {
+                           countNumber = 1
+                           countType   = "imageCountMoreThan"
+                           tagStatus   = "untagged"
                        }
                    },
+                   {
+                       action       = {
+                           type = "expire"
                        }
+                       description  = "Rotate images when reach 3 images stored"
+                       rulePriority = 3
+                       selection    = {
+                           countNumber = 3
+                           countType   = "imageCountMoreThan"
+                           tagStatus   = "any"
                        }
                    },
                ]
            }
        )
+       registry_id = (known after apply)
+       repository  = "softkit-nestjs-boilerplate-platform"
    }

  # module.ecr.aws_ecr_repository.name["softkit-nestjs-boilerplate-platform"] will be created
+   resource "aws_ecr_repository" "name" {
+       arn                  = (known after apply)
+       force_delete         = false
+       id                   = (known after apply)
+       image_tag_mutability = "IMMUTABLE"
+       name                 = "softkit-nestjs-boilerplate-platform"
+       registry_id          = (known after apply)
+       repository_url       = (known after apply)
+       tags                 = {
+           "Environment" = "deployment"
+           "Name"        = "softkitit-deployment-platform"
+           "Namespace"   = "softkitit"
+           "Project"     = "platform"
+           "Repository"  = "softkit-nestjs-boilerplate"
        }
+       tags_all             = {
+           "Environment" = "deployment"
+           "Name"        = "softkitit-deployment-platform"
+           "Namespace"   = "softkitit"
+           "Project"     = "platform"
+           "Repository"  = "softkit-nestjs-boilerplate"
        }

+       image_scanning_configuration {
+           scan_on_push = true
        }
    }

  # module.ecr.aws_ecr_repository_policy.name["softkit-nestjs-boilerplate-platform"] will be created
+   resource "aws_ecr_repository_policy" "name" {
+       id          = (known after apply)
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "ecr:*"
+                       Effect    = "Allow"
+                       Principal = {
+                           AWS = "*"
                        }
+                       Sid       = "FullAccess"
                    },
+                   {
+                       Action    = "ecr:*"
+                       Condition = {
+                           StringEquals = {
+                               "aws:PrincipalOrgID" = "o-9e3b32yz76"
                            }
                        }
+                       Effect    = "Allow"
+                       Principal = "*"
+                       Sid       = "OrganizationsFullAccess"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       registry_id = (known after apply)
+       repository  = "softkit-nestjs-boilerplate-platform"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [PR on main #21](https://github.com/softkitit/softkit-nestjs-boilerplate/actions/runs/8892830447)